import time 
from colorama import Fore, Back, Style

ban =Fore.MAGENTA+""" 



██╗   ██╗███████╗███████╗██████╗          █████╗  ██████╗ ██████╗ ██████╗ ██╗   ██╗███╗   ██╗████████╗
██║   ██║██╔════╝██╔════╝██╔══██╗        ██╔══██╗██╔════╝██╔════╝██╔═══██╗██║   ██║████╗  ██║╚══██╔══╝
██║   ██║███████╗█████╗  ██████╔╝        ███████║██║     ██║     ██║   ██║██║   ██║██╔██╗ ██║   ██║   
██║   ██║╚════██║██╔══╝  ██╔══██╗        ██╔══██║██║     ██║     ██║   ██║██║   ██║██║╚██╗██║   ██║   
╚██████╔╝███████║███████╗██║  ██║███████╗██║  ██║╚██████╗╚██████╗╚██████╔╝╚██████╔╝██║ ╚████║   ██║   
 ╚═════╝ ╚══════╝╚══════╝╚═╝  ╚═╝╚══════╝╚═╝  ╚═╝ ╚═════╝ ╚═════╝ ╚═════╝  ╚═════╝ ╚═╝  ╚═══╝   ╚═╝   
            |    P O W E R E D : A N O N Y M O U S     |                                                                                      

""" 
x=Fore.RED+"""
================================================================
|    T O O L S PENCARIAN JEJAK USERNAME AKUN SOSIAL MEDIA      |
================================================================

"""

print(ban)
print(x)
search = input(Fore.GREEN+"Masukkan username : \n")
print("Sedang memeriksa ... \n")
time.sleep(2)
print("-------------------------------")
print("FACEBOOK 🌎 ")
print(f"https://web.facebook.com/{search}")
print("")
print("INSTAGRAM 🕵🏿")
print(f"https://www.instagram.com/{search}")
print("")
print("TWITTER [✖️]")
print(f"https://x.com/{search}")
print("")
print("T I K T O K ✷")
print(f"https://tiktok.com/@{search}")
print("")
print("T E L E G R A M 🌐")
print(f"https://t.me/{search}")
print("")
print("Y O U T U B E 🛑")
print(f"https://youtube.com/@{search}")
print("")
print("P I N T E R E S T 🌀")
print(f"https://id.pinterest.com/{search}")
print("------------------------------------")



